In [20]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [21]:
df = pd.read_csv('Titanic-Dataset.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [23]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [24]:
from sklearn.base import BaseEstimator, TransformerMixin
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

from sklearn.preprocessing import StandardScaler




class Dropfeture(BaseEstimator, TransformerMixin):

    def fit(self,X,y=None):
        return self

    def transform(self,X):
        X = X.drop(['Name', 'Ticket','Cabin'], axis = 1)
        return X




class AgeImputer(BaseEstimator, TransformerMixin):
    
    def fit(self,X,y=None):
        return self

    
    def transform(self,X):
        impute = SimpleImputer(strategy = 'mean')
        X['Age'] = impute.fit_transform(X[['Age']])
        return X
        

class encoder(BaseEstimator, TransformerMixin):

    def fit(self,X,y = None):
        return self

    def transform(self, X):
        
        encode = OneHotEncoder(sparse_output = False)
        
        X1 = encode.fit_transform( pd.DataFrame(X[['Sex','Embarked']]) )

        X = X.drop(['Sex','Embarked'], axis = 1)
        X.columns = X.columns.astype(str)

        return pd.concat( [X, pd.DataFrame(X1)], axis = 1)



class Scalling(BaseEstimator, TransformerMixin):

    def fit(self, X, y = None):
        return self

    def transform(self, X):
        stdscalar = StandardScaler()
        X = stdscalar.fit_transform(X)
        X.columns = X.columns.astype(str)
        return X

In [25]:
from sklearn.pipeline import Pipeline
preprocess = Pipeline([

('dropper',Dropfeture()),
('encoder',encoder()),
('Age_imputer',AgeImputer())

])


Scalling_pipe = Pipeline([

('Scalling', Scalling())

])

In [26]:


df = preprocess.fit_transform(df)
#dtype(df.columns)
#Scalling_pipe.fit_transform(df)

df

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,0,1,2,3,4,5
0,1,0,3,22.000000,1,0,7.2500,0.0,1.0,0.0,0.0,1.0,0.0
1,2,1,1,38.000000,1,0,71.2833,1.0,0.0,1.0,0.0,0.0,0.0
2,3,1,3,26.000000,0,0,7.9250,1.0,0.0,0.0,0.0,1.0,0.0
3,4,1,1,35.000000,1,0,53.1000,1.0,0.0,0.0,0.0,1.0,0.0
4,5,0,3,35.000000,0,0,8.0500,0.0,1.0,0.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,27.000000,0,0,13.0000,0.0,1.0,0.0,0.0,1.0,0.0
887,888,1,1,19.000000,0,0,30.0000,1.0,0.0,0.0,0.0,1.0,0.0
888,889,0,3,29.699118,1,2,23.4500,1.0,0.0,0.0,0.0,1.0,0.0
889,890,1,1,26.000000,0,0,30.0000,0.0,1.0,1.0,0.0,0.0,0.0
890,891,0,3,32.000000,0,0,7.7500,0.0,1.0,0.0,1.0,0.0,0.0

In [27]:
#c = pd.DataFrame(df.columns)
#c

In [28]:
#c.info()

In [29]:
#c.describe()